PinguinoIDE/pinguino-compilers/linux32/p8/share/gputils/header/p18f95j94.inc
;----- ADCTMUEN0H Bits -----------------------------------------------------
CTMUEN8          EQU  H'0000'
CTMUEN9          EQU  H'0001'
CTMUEN10         EQU  H'0002'
CTMUEN11         EQU  H'0003'
CTMUEN12         EQU  H'0004'
CTMUEN13         EQU  H'0005'
CTMUEN14         EQU  H'0006'
CTMUEN15         EQU  H'0007'


;----- ADCTMUEN1L Bits -----------------------------------------------------
CTUMEN16         EQU  H'0000'
CTUMEN17         EQU  H'0001'
CTUMEN18         EQU  H'0002'
CTUMEN19         EQU  H'0003'
CTMUEN20         EQU  H'0004'
CTMUEN21         EQU  H'0005'
CTMUEN22         EQU  H'0006'
CTMUEN23         EQU  H'0007'


;----- ADCTMUEN1H Bits -----------------------------------------------------
CTUMEN24         EQU  H'0000'
CTUMEN25         EQU  H'0001'
CTUMEN26         EQU  H'0002'
CTUMEN27         EQU  H'0003'
CTUMEN28         EQU  H'0004'
CTUMEN29         EQU  H'0005'
CTMUEN30         EQU  H'0006'


;----- ADCHIT0L Bits -----------------------------------------------------
CHH0             EQU  H'0000'
CHH1             EQU  H'0001'
CHH2             EQU  H'0002'
CHH3             EQU  H'0003'
CHH4             EQU  H'0004'
CHH5             EQU  H'0005'
CHH6             EQU  H'0006'
CHH7             EQU  H'0007'


;----- ADCHIT0H Bits -----------------------------------------------------
CHH8             EQU  H'0000'
CHH9             EQU  H'0001'
CHH10            EQU  H'0002'
CHH11            EQU  H'0003'
CHH12            EQU  H'0004'
CHH13            EQU  H'0005'
CHH14            EQU  H'0006'
CHH15            EQU  H'0007'


;----- ADCHIT1L Bits -----------------------------------------------------
CHH16            EQU  H'0000'
CHH17            EQU  H'0001'
CHH18            EQU  H'0002'
CHH19            EQU  H'0003'
CHH20            EQU  H'0004'
CHH21            EQU  H'0005'
CHH22            EQU  H'0006'
CHH23            EQU  H'0007'


;----- ADCHIT1H Bits -----------------------------------------------------
CHH24            EQU  H'0000'
CHH25            EQU  H'0001'
CHH26            EQU  H'0002'
CHH27            EQU  H'0003'
CHH28            EQU  H'0004'
CHH29            EQU  H'0005'
CHH30            EQU  H'0006'


;----- ADCSS0L Bits -----------------------------------------------------
CSS0             EQU  H'0000'
CSS1             EQU  H'0001'
CSS2             EQU  H'0002'
CSS3             EQU  H'0003'
CSS4             EQU  H'0004'
CSS5             EQU  H'0005'
CSS6             EQU  H'0006'
CSS7             EQU  H'0007'


;----- ADCSS0H Bits -----------------------------------------------------
CSS8             EQU  H'0000'
CSS9             EQU  H'0001'
CSS10            EQU  H'0002'
CSS11            EQU  H'0003'
CSS12            EQU  H'0004'
CSS13            EQU  H'0005'
CSS14            EQU  H'0006'
CSS15            EQU  H'0007'


;----- ADCSS1L Bits -----------------------------------------------------
CSS16            EQU  H'0000'
CSS17            EQU  H'0001'
CSS18            EQU  H'0002'
CSS19            EQU  H'0003'
CSS20            EQU  H'0004'
CSS21            EQU  H'0005'
CSS22            EQU  H'0006'
CSS23            EQU  H'0007'


;----- ADCSS1H Bits -----------------------------------------------------
CSS24            EQU  H'0000'
CSS25            EQU  H'0001'
CSS26            EQU  H'0002'
CSS27            EQU  H'0003'
CSS28            EQU  H'0004'
CSS29            EQU  H'0005'
CSS30            EQU  H'0006'


;----- ADCHS0L Bits -----------------------------------------------------
CH0SA0           EQU  H'0000'
CH0SA1           EQU  H'0001'
CH0SA2           EQU  H'0002'
CH0SA3           EQU  H'0003'
CH0SA4           EQU  H'0004'
CH0NA0           EQU  H'0005'
CH0NA1           EQU  H'0006'
CH0NA2           EQU  H'0007'


;----- ADCHS0H Bits -----------------------------------------------------
CH0SB0           EQU  H'0000'
CH0SB1           EQU  H'0001'
CH0SB2           EQU  H'0002'
CH0SB3           EQU  H'0003'
CH0SB4           EQU  H'0004'
CH0NB0           EQU  H'0005'
CH0NB1           EQU  H'0006'
CH0NB2           EQU  H'0007'


;----- ADCON5L Bits -----------------------------------------------------
CM0              EQU  H'0000'
CM1              EQU  H'0001'
WM0_ADCON5L      EQU  H'0002'
WM1_ADCON5L      EQU  H'0003'


;----- ADCON5H Bits -----------------------------------------------------
CTMUREQ          EQU  H'0005'
LPENA            EQU  H'0006'
ASENA            EQU  H'0007'

ASINTMD0         EQU  H'0000'
ASINTMD1         EQU  H'0001'


;----- ADCON3L Bits -----------------------------------------------------
ADCS0            EQU  H'0000'
ADCS1            EQU  H'0001'
ADCS2            EQU  H'0002'
ADCS3            EQU  H'0003'
ADCS4            EQU  H'0004'
ADCS5            EQU  H'0005'
ADCS6            EQU  H'0006'
ADCS7            EQU  H'0007'


;----- ADCON3H Bits -----------------------------------------------------
PUMPEN           EQU  H'0005'
EXTSAM           EQU  H'0006'
ADRC             EQU  H'0007'

SAMC0            EQU  H'0000'
SAMC1            EQU  H'0001'
SAMC2            EQU  H'0002'
SAMC3            EQU  H'0003'
SAMC4            EQU  H'0004'


;----- ADCON2L Bits -----------------------------------------------------
ALTS             EQU  H'0000'
BUFM             EQU  H'0001'
BUFS             EQU  H'0007'

SMPI0            EQU  H'0002'
SMPI1            EQU  H'0003'
SMPI2            EQU  H'0004'
SMPI3            EQU  H'0005'
SMPI4            EQU  H'0006'


;----- ADCON2H Bits -----------------------------------------------------
CSCNA            EQU  H'0002'
BUFREGEN         EQU  H'0003'
OFFCAL           EQU  H'0004'
NVCFG0           EQU  H'0005'

PVCFG0           EQU  H'0006'
PVCFG1           EQU  H'0007'


;----- LCDDATA0 Bits -----------------------------------------------------
S00C0            EQU  H'0000'
S01C0            EQU  H'0001'
S02C0            EQU  H'0002'
S03C0            EQU  H'0003'
S04C0            EQU  H'0004'
S05C0            EQU  H'0005'
S06C0            EQU  H'0006'
S07C0            EQU  H'0007'


;----- LCDDATA1 Bits -----------------------------------------------------
S08C0            EQU  H'0000'
S09C0            EQU  H'0001'
S10C0            EQU  H'0002'
S11C0            EQU  H'0003'
S12C0            EQU  H'0004'
S13C0            EQU  H'0005'
S14C0            EQU  H'0006'
S15C0            EQU  H'0007'


;----- LCDDATA2 Bits -----------------------------------------------------
S16C0            EQU  H'0000'
S17C0            EQU  H'0001'
S18C0            EQU  H'0002'
S19C0            EQU  H'0003'
S20C0            EQU  H'0004'
S21C0            EQU  H'0005'
S22C0            EQU  H'0006'
S23C0            EQU  H'0007'


;----- LCDDATA3 Bits -----------------------------------------------------
S24C0            EQU  H'0000'
S25C0            EQU  H'0001'
S26C0            EQU  H'0002'
S27C0            EQU  H'0003'
S28C0            EQU  H'0004'
S29C0            EQU  H'0005'
S30C0            EQU  H'0006'
S31C0            EQU  H'0007'


;----- LCDDATA4 Bits -----------------------------------------------------
S32C0            EQU  H'0000'
S33C0            EQU  H'0001'
S34C0            EQU  H'0002'
S35C0            EQU  H'0003'
S36C0            EQU  H'0004'
S37C0            EQU  H'0005'
S38C0            EQU  H'0006'
S39C0            EQU  H'0007'


